<template>
  <section class="hz-container">
    <div style="height:46px">
      <div class="hz-fixed-header">
        <x-header>简繁体转换</x-header>
      </div>
    </div>
    <div @click="nextPage">点我试试</div>
    <div class="report-content"></div>
    <div>动态加载{{title}}</div>
    <div class="report-content">{{message}}</div>

    <div>
      鸿蒙系统是基于微内核的全场景分布式OS，可按需扩展，实现更广泛的系统安全，主要用于物联网，特点是低时延，甚至可到毫秒级乃至亚毫秒级。 
鸿蒙OS实现模块化耦合，对应不同设备可弹性部署，鸿蒙OS有三层架构，第一层是内核，第二层是基础服务，第三层是程序框架 。可用于大屏、PC、汽车等各种不同的设备上。还可以随时用在手机上，但暂时华为手机端依然优先使用安卓。
技术特点：


1、分布式架构首次用于终端OS，实现跨终端无缝协同体验。鸿蒙OS的“分布式OS架构”和“分布式软总线技术”通过公共通信平台，分布式数据管理，分布式能力调度和虚拟外设四大能力，将相应分布式应用的底层技术实现难度对应用开发者屏蔽，使开发者能够聚焦自身业务逻辑，像开发同一终端一样开发跨终端分布式应用，也使最终消费者享受到强大的跨终端业务协同能力为各使用场景带来的无缝体验。


2、 确定时延引擎和高性能IPC技术实现系统天生流畅。鸿蒙 OS通过使用确定时延引擎和高性能IPC两大技术解决现有系统性能不足的问题。确定时延引擎可在任务执行前分配系统中任务执行优先级及时限进行调度处理，优先级高的任务资源将优先保障调度，应用响应时延降低25.7%。鸿蒙微内核结构小巧的特性使IPC（进程间通信）性能大大提高，进程通信效率较现有系统提升5倍。
3、基于微内核架构重塑终端设备可信安全。鸿蒙OS采用全新的微内核设计，拥有更强的安全特性和低时延等特点。微内核设计的基本思想是简化内核功能，在内核之外的用户态尽可能多地实现系统服务，同时加入相互之间的安全保护。微内核只提供最基础的服务，比如多进程调度和多进程通信等。

鸿蒙OS将微内核技术应用于可信执行环境（TEE），通过形式化方法，重塑可信安全。形式化方法是利用数学方法，从源头验证系统正确，无漏洞的有效手段。传统验证方法如功能验证，模拟攻击等只能在选择的有限场景进行验证，而形式化方法可通过数据模型验证所有软件运行路径。 鸿蒙OS首次将形式化方法用于终端TEE，显著提升安全等级。同时由于鸿蒙OS微内核的代码量只有Linux宏内核的千分之一，其受攻击几率也大幅降低。


4、通过统一IDE支撑一次开发，多端部署，实现跨终端生态共享。鸿蒙OS凭借多终端开发IDE，多语言统一编译，分布式架构Kit提供屏幕布局控件以及交互的自动适配，支持控件拖拽，面向预览的可视化编程，从而使开发者可以基于同一工程高效构建多端自动运行App，实现真正的一次开发，多端部署，在跨设备之间实现共享生态。华为方舟编译器是首个取代Android虚拟机模式的静态编译器，可供开发者在开发环境中一次性将高级语言编译为机器码。此外，方舟编译器未来将支持多语言统一编译，可大幅提高开发效率。

    </div>
  </section>
</template>
<script>
import { XHeader } from "vux";

export default {
  components: {
    XHeader
  },
  data() {
    return {
      title: Config.title,
      holderMessage: Config.holderMessage,
      message:
        "余承东将现在的世界称为“万物互联”的世界，无论是在家中还是在办公，都需要大量的IOT设备。那么在这种场景下，什么样的OS才能满足需求？未来万物互联智能，不可能为所有硬件开发OS，而安卓/Linux代码冗长，难以保持流畅度。华为表示，鸿蒙OS的架构最底层是内核层，上面是基础服务层、程序框架。通过这些设置，可以支撑各种不同的设备，包括智慧大屏、穿戴、车机、音箱，甚至手表穿戴、手机等等。通过一套系统，一个IOS实现模块化的结构，对应不同的设备可以弹性部署。不管硬件能力强的，还是硬件能力弱的，都可以使用一套操作系统，可以统一在不同的硬件平台上进行加载和部署。"
    };
  },
  mounted() {
    console.log("home mounted");
    this.$translatePage();

    setTimeout(() => {
      this.message = `为什么采用微内核？就是因为内核级的安全。从计算机被发明以来，一直以来都是采用宏内核，无论使用什么样的模拟攻击，都无法实现完全覆盖以保证绝对安全。今天要进入微内核时代，而华为的微内核——鸿蒙微内核在安卓手机平板等设备上已经投入商用了，包括从mate20之后的很多华为智能终端都已经用了鸿蒙的微内核，带来了前所未有的安全。`;
    }, 3000);
    setTimeout(() => {
      this.message = "下一条源字符串是繁体";
    }, 6000);
    setTimeout(() => {
      this.message = `為什麼采用微內核？就是因為內核級的安全。從計算機被發明以來，一直以來都是采用宏內核，無論使用什麼樣的模擬攻擊，都無法實現完全覆蓋以保證絕對安全。今天要進入微內核時代，而華為的微內核——鴻蒙微內核在安卓手機平板等設備上已經投入商用了，包括從mate20之後的很多華為智能終端都已經用了鴻蒙的微內核，帶來了前所未有的安全。`
    }, 9000);
  },
  updated() {
    console.log("home updated");
    this.$translatePage();
  },
  methods: {
    nextPage() {
      this.$router.push("detail");
    }
  }
};
</script>
<style scoped>
.hz-container {
  display: block;
  padding: 0;
  margin: 0;
}

.hz-background {
  background-color: #efefef;
}

.hz-fixed-header {
  position: fixed;
  left: 0;
  right: 0;
  top: 0;
  z-index: 9;
  height: 46px;
}

.report-content {
  margin-top: 50px;
  text-align: center;
  color: #9c9c9c;
  font-size: 20px;
}
</style>
